Repository: craftersmine/LeagueBalancer
Catalog: craftersmine.LeagueBalancer/Localization/Locale.*.resx
Languages: ru_ru, sv_se

# CrashHandlerWindow.Buttons.CopyToClipboard
source: Copy Info to Clipboard
ru_ru: Скопировать инфо.
sv_se: Kopiera information

# CrashHandlerWindow.Buttons.OpenIssues
source: Open GitHub Issues
ru_ru: Открыть GitHub Issues
sv_se: Öppna GitHub Issues

# CrashHandlerWindow.Buuttons.CloseApp
source: Close application
ru_ru: Закрыть приложение
sv_se: Stäng programmet

# CrashHandlerWindow.Description
source: In order to debug and fix the problem, please open an issue at project GitHub page. Please include following information in text format.
ru_ru: Для того чтобы отладить и исправить проблему, откройте тикет на странице проекта GitHub. Пожалуйста, включите следующую информацию в текстовом формате.
sv_se: För att felsöka och åtgärda problemet, öppna ett problem på projekt GitHub-sidan. Vänligen inkludera följande information i textformat.

# CrashHandlerWindow.Label.ExceptionMessage
source: Exception message:
ru_ru: Сообщение исключения:
sv_se: Undantag meddelande:

# CrashHandlerWindow.Label.ExceptionStacktrace
source: Exception stacktrace:
ru_ru: Трассировка стека вызовов исключения:
sv_se: Undantag stacktrace:

# CrashHandlerWindow.Label.ExceptionType
source: Exception type:
ru_ru: Тип исключения:
sv_se: Undantag typ:

# CrashHandlerWindow.Title
source: Unfortunately, the application has crashed!
ru_ru: Возникла непредвиденая ошибка!
sv_se: Tyvärr har applikationen kraschat!

# MainWindow.Buttons.AddSummoner.ToolTip
source: Add Player
ru_ru: Добавить игрока
sv_se: Lägg till spelare

# MainWindow.Buttons.Balance
source: BALANCE
ru_ru: СБАЛАНСИРОВАТЬ
sv_se: BALANCERA

# MainWindow.Buttons.Balance.ToolTip
source: Balance teams by LP
ru_ru: Сбалансировать команды по LP
sv_se: Balansspelare efter LP

# MainWindow.Buttons.ClearSummonersList.ToolTip
source: Clear Players list
ru_ru: Очистить список игроков
sv_se: Rensa spelarlistan

# MainWindow.Buttons.CopySummonersListToClipboard.ToolTip
source: Copy all players characters into clipboard
ru_ru: Скопировать всех игроков в буфер обмена
sv_se: Kopiera alla spelares karaktärer till urklipp

# MainWindow.Buttons.GetRandomCharacters
source: Get Randomized Champions For All
ru_ru: Сгенерировать чемпионов для всех
sv_se: Randomisera karaktärer för alla

# MainWindow.Buttons.GetRandomCharacters.ToolTip
source: Roll champions for every player
ru_ru: Сгенерировать чемпионов для каждого игрока в списке
sv_se: Randomizera karaktärer för värje spelare i listan

# MainWindow.Buttons.ImportFromClipboard.ToolTip
source: Import players from lobby chat
ru_ru: Импортировать игроков с чата лобби
sv_se: Importera spelare från lobbychatt

# MainWindow.Buttons.OpenHideChampionsList
source: Open/Hide Champions List in text form
ru_ru: Открыть/скрыть список чемпионов текстом
sv_se: Öppna/Dölj teckenlisten i textform

# MainWindow.Buttons.OpenHideChampionsList.ToolTip
source: Opens or hides champions list in text form that you can copy
ru_ru: Открывает или скрывает список чемпионов в текстовой форме откуда вы можете скопировать текст
sv_se: Öppnar eller döljer teckenlisten i textform som du kan kopiera

# MainWindow.Buttons.RemoveSummoner.ToolTip
source: Remove Player
ru_ru: Удалить игрока
sv_se: Ta bort spelaren

# MainWindow.Buttons.RerollSummonerCharacters
source: Reroll Summoner Champions
ru_ru: Обновить чемпионов игрока
sv_se: Uppdatera spelarkaraktärerna

# MainWindow.Buttons.RerollSummonerCharacters.ToolTip
source: Reroll champions for selected player
ru_ru: Сгенерировать новых чемпионов для выбранного игрока
sv_se: Uppdatera karaktärer för vald spelare

# MainWindow.ComboBox.Region.ToolTip
source: Select a player region
ru_ru: Выберите регион аккаунта игрока
sv_se: Välj en spelarregion

# MainWindow.Copyright
source: Made by craftersmine with ❤️ - App version
ru_ru: Сделано craftersmine ❤️ - Версия приложения
sv_se: Tillverkad av craftersmine med ❤️ - Appversion

# MainWindow.Disclaimer
source: This application was created under Riot Games' "Legal Jibber Jabber" policy using assets owned by Riot Games. Riot Games does not endorse or sponsor this project.
ru_ru: Это приложение создано под условиями Riot Games "Legal Jibber Jabber" используя ресурсы под владением Riot Games. Riot Games не поддерживает или/и не спонсирует данный проект.
sv_se: Denna applikation skapades under Riot Games "Legal Jibber Jabber"-policy med tillgångar som ägs av Riot Games. Riot Games stöder eller sponsrar inte detta projekt.

# MainWindow.Label.AvailableCharacterPool
source: Available Pool:
ru_ru: Доступный пул:
sv_se: Tillgänglig pool:

# MainWindow.Label.BlueTeam
source: Blue Team
ru_ru: Синяя команда
sv_se: Blå laget

# MainWindow.Label.ChampionsListTip
source: Select player in players list to generate champions
ru_ru: Выберите игрока в списке игроков чтобы сгенерировать чемпионов
sv_se: Välj spelare i spelarlistan för att skapa karaktärer

# MainWindow.Label.RedTeam
source: Red Team
ru_ru: Красная команда
sv_se: Röda laget

# MainWindow.Links.BugReport
source: 🔗 Report a Bug
ru_ru: 🔗 Сообщить об ошибке
sv_se: 🔗 Rapportera en bugg

# MainWindow.Links.GitHub
source: 🔗 GitHub Page
ru_ru: 🔗 Страница GitHub
sv_se: 🔗 GitHub-sida

# MainWindow.Links.RequestFeature
source: 🔗 Request a feature
ru_ru: 🔗 Запросить фичу
sv_se: 🔗 Begär en funktion

# MainWindow.Links.UpdateAvailable
source: 🔄️ Update Available!
ru_ru: 🔄️ Доступно обновление
sv_se: 🔄️ Uppdatering tillgänglig

# MainWindow.Slider.AvailableCharacterPoolSize.ToolTip
source: Amount of characters to generate
ru_ru: Количество чемпионов чтобы сгенерировать
sv_se: Antal tecken att generera

# MainWindow.TextBox.RiotId.ToolTip
source: Riot ID (e.g. craftersmine#Ornn)
ru_ru: Riot ID (например: craftersmine#Ornn)
sv_se: Riot ID (typ: craftersmine#Ornn)

# MainWindow.Title
source: League of Legends Custom Game Team Balancer
ru_ru: Балансировщик команд для своих игр League of Legends

# MainWindow.Message.BrokenApiKey.Content
source: Unable to access Riot Games API due to issue with Application API key! Contact app developer about this error!
ru_ru: Не удалось получить доступ к Riot Games API в связи с проблемой с ключем API приложения! Свяжитесь с разработчиком приложения для решения данной проблемы!
sv_se: Det går inte att komma åt Riot Games API på grund av problem med Application API-nyckeln! Kontakta apputvecklaren om detta fel!

# MainWindow.Message.BrokenApiKey.Title
source: Expired or broken API key!
ru_ru: API ключ сломан или истек срок действия ключа!
sv_se: Förfallen eller trasig API-nyckel!

# MainWindow.Message.InvalidRiotId.Content
source: RiotID Tagline isn't specified! Specify correct RiotID in this format: username#tag
ru_ru: Не указан RiotID тэг! Укажите корректный RiotID в следующем формате: username#tag
sv_se: RiotID Tagline är inte specificerad! Ange korrekt RiotID i detta format: användarnamn#tagg

# MainWindow.Message.InvalidRiotId.Title
source: Invalid RiotID
ru_ru: Неверный RiotID
sv_se: Ogiltigt RiotID

# MainWindow.Message.RateLimited.Content
source: Unable to access Riot Games API due to being rate-limited! Try again after {0}
ru_ru: Не удалось получить доступ к Riot Games API, поскольку вы сделали слишком много запросов за раз! Повторите попытку позднее через: {0}
sv_se: Det går inte att komma åt Riot Games API på grund av att det är hastighetsbegränsat! Försök igen efter {0}

# MainWindow.Message.RateLimited.Title
source: Rate-limited!
ru_ru: Эй, эй, полегче!
sv_se: Prisbegränsad!

# MainWindow.Message.UnableToFindPlayer.Content
source: Unable to player find "{0}#{1}" on {2} server! Check if RiotID is correct and selected right server.
ru_ru: Не удалось найти игрока "{0}#{1}" на сервере "{2}"! Проверьте, корректный ли указан RiotID и выбран корректный сервер.
sv_se: Det gick inte att spelaren hitta "{0}#{1}" på {2}-servern! Kontrollera om RiotID är korrekt och vald rätt server.

# MainWindow.Message.UnableToFindPlayer.Title
source: Unable to find player!
ru_ru: Не удалось найти игрока!
sv_se: Kan inte hitta spelare!

# MainWindow.Message.UnknownError.Content
source: Unable to access Riot Games API due to unknown error! {0}
ru_ru: Не удалось получить доступ к Riot Games API в связи с неизветсной ошибкой! {0}
sv_se: Det går inte att komma åt Riot Games API på grund av okänt fel! {0}

# MainWindow.Message.UnknownError.Title
source: Failed!
ru_ru: Ошибка!
sv_se: Misslyckades!

# MainWindow.String.RolledChampions
source: Rolled champions: {0}
ru_ru: Сгенерированные чемпионы: {0}
sv_se: Rullade mästare: {0}

# RankedTier.Bronze
source: Bronze
ru_ru: Бронза
sv_se: Brons

# RankedTier.Challenger
source: Challenger
ru_ru: Претендент
sv_se: Utmanare

# RankedTier.Diamond
source: Diamond
ru_ru: Алмаз
sv_se: Diamant

# RankedTier.Emerald
source: Emerald
ru_ru: Изумруд
sv_se: Smaragd

# RankedTier.Gold
source: Gold
ru_ru: Золото
sv_se: Guld

# RankedTier.Grandmaster
source: Grandmaster
ru_ru: Грандмастер
sv_se: Stromästare

# RankedTier.Iron
source: Iron
ru_ru: Железо
sv_se: Järn

# RankedTier.Master
source: Master
ru_ru: Мастер
sv_se: Bemästra

# RankedTier.Platinum
source: Platinum
ru_ru: Платина
sv_se: Platina

# RankedTier.Silver
source: Silver
ru_ru: Серебро

# RankedTier.Unranked
source: Unranked
ru_ru: Без ранга
sv_se: Orankad

# Region.Brazil
source: Brazil
ru_ru: Бразилия
sv_se: Brasilien

# Region.EuropeNordicEast
source: Europe Nordic East
ru_ru: Северо-восточная Европа
sv_se: Nordöstra Europa

# Region.EuropeWest
source: Europe West
ru_ru: Западная Европа
sv_se: Västra Europa

# Region.Japan
source: Japan
ru_ru: Япония

# Region.Korea
source: Korea
ru_ru: Корея

# Region.LatinAmericaNorth
source: Latin America North
ru_ru: Северная Латинская Америка
sv_se: Latinamerika Norr

# Region.LatinAmericaSouth
source: Latin America South
ru_ru: Южная Латинская Америка
sv_se: Latinamerika Syd

# Region.NorthAmerica
source: North America
ru_ru: Северная Америка
sv_se: Nordamerika

# Region.Oceania
source: Oceania
ru_ru: Океания
sv_se: Oceanien

# Region.Philippines
source: Philippines
ru_ru: Филиппины
sv_se: Filippinerna

# Region.Russia
source: Russia and CIS
ru_ru: Россия и СНГ
sv_se: Ryssland och OSS

# Region.Singapore
source: Singapore
ru_ru: Сингапур

# Region.Taiwan
source: Taiwan
ru_ru: Тайвань

# Region.Thailand
source: Thailand
ru_ru: Тайланд

# Region.Turkey
source: Turkey
ru_ru: Турция
sv_se: Kalkon

# Region.Vietnam
source: Vietnam
ru_ru: Вьетнам

# MainWindow.List.Summoners.Label.Rank
source: Rank:
ru_ru: Ранг:
sv_se: Rang:

# MainWindow.List.Champions.Mastery
source: Mastery points:
ru_ru: Мастерство:
sv_se: Herravälde:

# MainWindow.List.Summoners.Label.Level
source: Lvl:
ru_ru: Ур.:

# SettingsWindow.Buttons.Ok
source: OK
ru_ru: ОК

# SettingsWindow.Label.Language
source: Application Language:
ru_ru: Язык приложения:
sv_se: Applikationsspråk:

# SettingsWindow.Title
source: Settings
ru_ru: Настройки
sv_se: Inställningar
